Repository: DevMohammad-SA/EasyPDFtoJPG
Catalog: translations/*/LC_MESSAGES/messages.po
Languages: ar

source: About EasyPDF to JPG
ar: حول EasyPDF إلى JPG

source: Welcome to
ar: مرحبًا بك في

source: PDF to JPG Converter
ar: محول PDF إلى JPG

source: ! Our goal is to provide a simple and efficient way for users to convert their PDF documents into high-quality JPG images. Whether you need to extract images from a report, share parts of a document, or simply save a document as an image, we’ve got you covered.
ar: ! هدفنا هو توفير طريقة بسيطة وفعالة للمستخدمين لتحويل مستنداتهم PDF إلى صور JPG عالية الجودة. سواء كنت بحاجة إلى استخراج صور من تقرير، أو مشاركة أجزاء من مستند، أو ببساطة حفظ المستند كصورة، فنحن هنا لمساعدتك.

source: Our Mission:
ar: مهمتنا:

source: We aim to make PDF to image conversion easy and accessible for everyone. With just a few clicks, you can upload your PDF and get a set of JPG images that can be shared, downloaded, or printed.
ar: نهدف إلى جعل تحويل PDF إلى صور سهلاً ومتاحاً للجميع. ببضع نقرات فقط، يمكنك رفع ملف PDF الخاص بك والحصول على مجموعة من صور JPG التي يمكن مشاركتها أو تنزيلها أو طباعتها.

source: Features
ar: الميزات

source: Multiple File Support:
ar: دعم ملفات متعددة:

source: Upload and convert multiple PDFs at once.
ar: قم برفع وتحويل ملفات PDF متعددة دفعة واحدة.

source: High-Quality Images:
ar: صور عالية الجودة:

source: We ensure that your images retain their original quality during conversion.
ar: نضمن أن تحتفظ الصور بجودتها الأصلية أثناء عملية التحويل.

source: Free & Easy to Use:
ar: مجاني وسهل الاستخدام:

source: Our tool is completely free to use, with no sign-up required.
ar: أداتنا مجانية تماماً للاستخدام، ولا تتطلب تسجيل حساب.

source: Quick Conversion
ar: تحويل سريع

source: Convert your files within seconds.
ar: قم بتحويل ملفاتك في غضون ثوانٍ.

source: Thank you for choosing
ar: شكرًا لاختيارك

source: ! We are committed to offering you the best service and making your PDF-to-image conversion needs as simple as possible.
ar: ! نحن ملتزمون بتقديم أفضل خدمة وجعل احتياجاتك لتحويل PDF إلى صور بأبسط شكل ممكن.

source: Home
ar: الرئيسية

source: About
ar: حول

source: Contact
ar: اتصل بنا

source: Get in Touch
ar: تواصل معنا

source: Send me a message and I will get back to you as soon as possible
ar: أرسل لي رسالة وسأرد عليك في أقرب وقت ممكن

source: Name
ar: الاسم

source: Email
ar: البريد الإلكتروني

source: Message
ar: الرسالة

source: Send Message
ar: إرسال الرسالة

source: You already sent a message. It will be reviewed soon.
ar: لقد أرسلت رسالة بالفعل. سيتم مراجعتها قريبًا.

source: Fast and Easy PDF to JPG Conversion
ar: تحويل سريع وسهل من PDF إلى JPG

source: Upload your PDF file and get high-quality JPG images in seconds
ar: قم برفع ملف PDF الخاص بك واحصل على صور JPG عالية الجودة في ثوانٍ

source: No downloads required, secure and fast.
ar: لا حاجة إلى تنزيلات، آمن وسريع.

source: Ready to convert your PDFs? Upload your file now and get started!
ar: جاهز لتحويل ملفات PDF الخاصة بك؟ قم برفع الملف الآن وابدأ!

source: Upload
ar: رفع

source: How It Works
ar: كيف تعمل

source: Select the PDF file you want to convert by clicking "Choose File".
ar: حدد ملف PDF الذي تريد تحويله بالنقر على "اختر الملف".

source: Press the "Upload" button to start the conversion.
ar: اضغط على زر "رفع" لبدء عملية التحويل.

source: Download your JPG files instantly once the conversion is complete.
ar: قم بتنزيل ملفات JPG الخاصة بك فور اكتمال التحويل.

source: Need help? Contact me at
ar: تحتاج إلى مساعدة؟ اتصل بي على

source: Your PDF Has Been Successfully Converted! 🎉
ar: تم تحويل ملف PDF الخاص بك بنجاح! 🎉

source: Click the "Download" button to save the converted image to your device.
ar: اضغط على زر "تنزيل" لحفظ الصورة المحولة على جهازك.

source: Want to convert another file? Use the "Go Back" link below to upload a new PDF.
ar: تريد تحويل ملف آخر؟ استخدم رابط "رجوع" أدناه لتحميل ملف PDF جديد.

source: Image Name
ar: اسم الصورة

source: Preview
ar: معاينة

source: Actions
ar: الإجراءات

source: Download
ar: تنزيل

source: Note: The images are optimized for high quality. For better results, upload a high-resolution PDF.
ar: ملاحظة: تم تحسين الصور للحصول على جودة عالية. للحصول على نتائج أفضل، قم برفع ملف PDF بدقة عالية.

source: Your feedback is valuable! If you encounter any issues, visit the Contact page for support.
ar: ملاحظاتك قيمة! إذا واجهت أي مشكلات، قم بزيارة صفحة الاتصال للحصول على الدعم.

source: Go Back
ar: رجوع

source: Message Sent Successfully! 🎉
ar: تم إرسال الرسالة بنجاح! 🎉

source: Thank you for your feedback. We appreciate you taking the time to help us improve!
ar: شكرًا لك على ملاحظاتك. نحن نقدر تخصيصك الوقت لمساعدتنا على التحسين!

source: Return to Home
ar: العودة إلى الصفحة الرئيسية
